backend/Catalogs/ОбъектыНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ОбъектыНедвижимости</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЖилья</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЖилья</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗаНочь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКомнат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КоличествоКомнат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КоличествоМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЗаезда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВремяЗаезда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыезда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВремяВыезда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоординатаХ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоординатаУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКАватарке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыУдобств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Опция</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыУдобств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

backend/Catalogs/ОбъектыНедвижимости/Ext/ManagerModule.bsl
Функция ПолучитьСписок() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбъектыНедвижимости.Код КАК Код,
	|	ОбъектыНедвижимости.Наименование КАК Наименование,
	|	ОбъектыНедвижимости.ВидЖилья КАК ВидЖилья,
	|	ОбъектыНедвижимости.ЦенаЗаНочь КАК ЦенаЗаНочь,
	|	ОбъектыНедвижимости.КоличествоКомнат КАК КоличествоКомнат,
	|	ОбъектыНедвижимости.КоличествоМест КАК КоличествоМест,
	|	ОбъектыНедвижимости.ВремяЗаезда КАК ВремяЗаезда,
	|	ОбъектыНедвижимости.ВремяВыезда КАК ВремяВыезда,
	|	ОбъектыНедвижимости.Описание КАК Описание,
	|	ОбъектыНедвижимости.Адрес КАК Адрес,
	|	ОбъектыНедвижимости.КоординатаХ КАК КоординатаХ,
	|	ОбъектыНедвижимости.КоординатаУ КАК КоординатаУ,
	|	ОбъектыНедвижимости.ПутьКАватарке КАК ПутьКАватарке,
	|	ОбъектыНедвижимости.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ОбъектыНедвижимости КАК ОбъектыНедвижимости
	|ГДЕ
	|	ОбъектыНедвижимости.ПометкаУдаления = ЛОЖЬ";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
